EDT/УТ/src/InformationRegisters/зпСтавкиОплатыПоНачислениям/зпСтавкиОплатыПоНачислениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпСтавкиОплатыПоНачислениям</name>
  <resources>
    <name>СтавкаЗаСмену</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаЗаЧасПереработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаЗаЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОплатыПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаЗаКилометрПробега</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаЗаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДобавляемоеКоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаЗаПарковку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаРейсаРасчетное</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФиксированнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкМинимальногоПробегаПоРейсу</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкЧасовПереработки</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПолигоновПарковки</name>
    <type>
      <types>CatalogRef.зпВидыПолигоновПарковки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/зпСпособыРасчетаНачислений/зпСпособыРасчетаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>зпСпособыРасчетаНачислений</name>
  <enumValues>
    <name>ПоЗаказу</name>
  </enumValues>
  <enumValues>
    <name>СтавкаЗаСмену</name>
  </enumValues>
  <enumValues>
    <name>УчетЧасов</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПодъемаНаЭтаж</name>
  </enumValues>
  <enumValues>
    <name>ЗаКилометрПробега</name>
  </enumValues>
  <enumValues>
    <name>СтавкаЗаЧас</name>
  </enumValues>
  <enumValues>
    <name>СтавкаЗаЧасПереработки</name>
  </enumValues>
  <enumValues>
    <name>ФиксированнаяСтавка</name>
  </enumValues>
  <enumValues>
    <name>ПримеркаЗаказаПоТарифуПартнера</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/зпНачисления/зпНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зпНачисления</name>
  <predefined>
    <items>
      <name>ВыполнениеЗабора</name>
      <description>Выполнение забора</description>
    </items>
    <items>
      <name>ВыполнениеФрахта</name>
      <description>Выполнение фрахта</description>
    </items>
    <items>
      <name>ДоплатаДоМинимальногоРазмераОплаты</name>
      <description>Доплата до минимального размера оплаты</description>
    </items>
    <items>
      <name>ДоплатаЗаПарковку</name>
      <description>Доплата за парковку</description>
    </items>
    <items>
      <name>ДоплатаЗаПробег</name>
      <description>Доплата за пробег</description>
    </items>
    <items>
      <name>ДоплатаЗаПробегЗаМКАД</name>
      <description>Доплата за пробег (за МКАД)</description>
    </items>
    <items>
      <name>ДоплатаЗаЧасыПереработки</name>
      <description>Доплата за часы переработки</description>
    </items>
    <items>
      <name>ДоплатаЗаЭкспедирование</name>
      <description>Доплата за экспедирование</description>
    </items>
    <items>
      <name>ДоставкаЗаказа</name>
      <description>Доставка заказа</description>
    </items>
    <items>
      <name>ДоставкаЗаказаVIP</name>
      <description>Доставка заказа (VIP)</description>
    </items>
    <items>
      <name>МагистральныйРейс</name>
      <description>Магистральный рейс</description>
    </items>
    <items>
      <name>НочнойВодитель</name>
      <description>Ночной водитель</description>
    </items>
    <items>
      <name>ОплатаПоСменам</name>
      <description>Оплата по сменам</description>
    </items>
    <items>
      <name>ОплатаПодъемаНаЭтажПриДоставкеЗаказа</name>
      <description>Оплата подъема на этаж (доставка заказа)</description>
    </items>
    <items>
      <name>Примерка</name>
      <description>Примерка</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.зпСпособыРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетЧасовПереработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбслуживанияДоставки</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>EnumRef.зпВидыНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеНачислениеИспользуетсяВФиксацииНачислений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоУмолчаниюВФиксацииНачислений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислениеНеАктуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/зпСтавкиОплатыПоНачислениям/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопированиеЗаписи = Не Параметры.ЗначениеКопирования.Пустой();
	
	ТарифРасчетаЗП = Запись.ТарифРасчетаЗП;
	
	СхемаБрейковПробегаПоРейсу = ТарифРасчетаЗП.СхемаБрейковПробегаПоРейсу;
	СхемаБрейковЧасовПереработки = ТарифРасчетаЗП.СхемаБрейковЧасовПереработки;
	
	СхемаРасчетаЗП = Запись.СхемаРасчетаЗП;
	Если Не СхемаРасчетаЗП.ВидПолигоновПарковкиСтандарт.Пустая() Тогда
		Элементы.ВидПолигоновПарковки.СписокВыбора.Добавить(СхемаРасчетаЗП.ВидПолигоновПарковкиСтандарт);
	КонецЕсли;
	Если Не СхемаРасчетаЗП.ВидПолигоновПарковкиПовышеннаяОплата.Пустая() Тогда
		Элементы.ВидПолигоновПарковки.СписокВыбора.Добавить(СхемаРасчетаЗП.ВидПолигоновПарковкиПовышеннаяОплата);
	КонецЕсли;
	Элементы.ВидПолигоновПарковки.СписокВыбора.СортироватьПоПредставлению();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Наименование КАК Наименование
	|ИЗ
	|	(ВЫБРАТЬ
	|		зпНачисления.Ссылка КАК Ссылка,
	|		зпНачисления.Наименование КАК Наименование
	|	ИЗ
	|		Справочник.зпНачисления КАК зпНачисления
	|	ГДЕ
	|		зпНачисления.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.зпСпособыРасчетаНачислений.СтавкаЗаСмену), ЗНАЧЕНИЕ(Перечисление.зпСпособыРасчетаНачислений.УчетЧасов), ЗНАЧЕНИЕ(Перечисление.зпСпособыРасчетаНачислений.ПоЗаказу), ЗНАЧЕНИЕ(Перечисление.зпСпособыРасчетаНачислений.ЗаКилометрПробега), ЗНАЧЕНИЕ(Перечисление.зпСпособыРасчетаНачислений.СтавкаЗаЧас), ЗНАЧЕНИЕ(Перечисление.зпСпособыРасчетаНачислений.СтавкаЗаЧасПереработки), ЗНАЧЕНИЕ(Перечисление.зпСпособыРасчетаНачислений.ФиксированнаяСтавка), ЗНАЧЕНИЕ(Перечисление.зпСпособыРасчетаНачислений.ПримеркаЗаказаПоТарифуПартнера))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		зпНачисления.Ссылка,
	|		зпНачисления.Наименование
	|	ИЗ
	|		Справочник.зпНачисления КАК зпНачисления
	|	ГДЕ
	|		зпНачисления.Ссылка В (ЗНАЧЕНИЕ(Справочник.зпНачисления.ОплатаПодъемаНаЭтажПриДоставкеЗаказа), ЗНАЧЕНИЕ(Справочник.зпНачисления.ДоплатаЗаПарковку))) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Элементы.Начисление.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

	УправлениеДоступностьюЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеПриИзменении(Элемент)
	
	УправлениеДоступностьюЭлементов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыНачисления(Начисление)
	
	ПараметрыНачисления = Новый Структура();
	ПараметрыНачисления.Вставить("УчетЧасовПереработки", 	Начисление.УчетЧасовПереработки);
	ПараметрыНачисления.Вставить("СпособРасчетаПоЗаказу", 	Начисление.СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.ПоЗаказу);
	ПараметрыНачисления.Вставить("СпособРасчетаЗаСмену", 	Начисление.СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.СтавкаЗаСмену);
	Возврат ПараметрыНачисления; 
	
КонецФункции

//Геннадий #4455 29.10.2021 ->
&НаСервере
Процедура УправлениеДоступностьюЭлементов()
	
	Начисление = Запись.Начисление;
	
	Если Начисление = Справочники.зпНачисления.ОплатаПодъемаНаЭтажПриДоставкеЗаказа Тогда
		Элементы.ПроцентОплатыПодъема.Доступность = Истина;
	Иначе
		Элементы.ПроцентОплатыПодъема.Доступность = Ложь;
		Запись.ПроцентОплатыПодъема = 0;
	КонецЕсли;
	
	Если Начисление = Справочники.зпНачисления.ДоплатаЗаПарковку Тогда
		Элементы.ВидПолигоновПарковки.Доступность = Истина;
		Элементы.СтавкаЗаПарковку.Доступность = Истина;
	Иначе
		Элементы.ВидПолигоновПарковки.Доступность = Ложь;
		Элементы.СтавкаЗаПарковку.Доступность = Ложь;
		Запись.ВидПолигоновПарковки = Неопределено;
		Запись.СтавкаЗаПарковку = 0;
	КонецЕсли;
	
	СпособРасчета = Начисление.СпособРасчета;
	
	Если СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.ПоЗаказу Тогда
		//СпособРасчетаПоЗаказу
		Элементы.СтавкаЗаЗаказ.Доступность = Истина;
	Иначе
		Элементы.СтавкаЗаЗаказ.Доступность = Ложь;
		Запись.СтавкаЗаЗаказ = 0;
	КонецЕсли;
	
	Если СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.СтавкаЗаСмену Или СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.УчетЧасов Или Начисление.УчетЧасовПереработки Тогда
		//СпособРасчетаЗаСмену
		Элементы.СтавкаЗаСмену.Доступность = Истина;
	Иначе
		Элементы.СтавкаЗаСмену.Доступность = Ложь;
		Запись.СтавкаЗаСмену = 0;
	КонецЕсли;
	
	Если СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.ЗаКилометрПробега Тогда
		Элементы.СтавкаЗаКилометрПробега.Доступность = Истина;
		Элементы.БрейкМинимальногоПробегаПоРейсу.Доступность = Истина;
	Иначе
		Элементы.СтавкаЗаКилометрПробега.Доступность = Ложь;
		Запись.СтавкаЗаКилометрПробега = 0;
		Элементы.БрейкМинимальногоПробегаПоРейсу.Доступность = Ложь;
		Запись.БрейкМинимальногоПробегаПоРейсу = Неопределено;
	КонецЕсли;
	
	Если СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.СтавкаЗаЧас Или СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.СтавкаЗаЧасПереработки Тогда
		Элементы.СтавкаЗаЧас.Доступность = Истина;
		Элементы.ДобавляемоеКоличествоЧасов.Доступность = Истина;
	Иначе
		Элементы.СтавкаЗаЧас.Доступность = Ложь;
		Запись.СтавкаЗаЧас = 0;
		Элементы.ДобавляемоеКоличествоЧасов.Доступность = Ложь;
		Запись.ДобавляемоеКоличествоЧасов = 0;
	КонецЕсли;
	
	Если СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.СтавкаЗаЧас Тогда
		Элементы.ВремяНачалаРейсаРасчетное.Доступность = Истина;
	Иначе
		Элементы.ВремяНачалаРейсаРасчетное.Доступность = Ложь;
		Запись.ВремяНачалаРейсаРасчетное = Неопределено;
	КонецЕсли;
	
	Если СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.СтавкаЗаЧасПереработки Тогда
		Элементы.БрейкЧасовПереработки.Доступность = Истина;
	Иначе
		Элементы.БрейкЧасовПереработки.Доступность = Ложь;
		Запись.БрейкЧасовПереработки = Неопределено;
	КонецЕсли;
	
	Если СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.ФиксированнаяСтавка Тогда
		Элементы.ФиксированнаяСтавка.Доступность = Истина;
	Иначе
		Элементы.ФиксированнаяСтавка.Доступность = Ложь;
		Запись.ФиксированнаяСтавка = 0;
	КонецЕсли;
	
КонецПроцедуры	
//Геннадий 29.10.2021 <-

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.Должность.Пустая() Или КопированиеЗаписи Тогда
		Запись.Должность = Запись.Роль;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Начисление = Справочники.зпНачисления.ДоплатаЗаПарковку Тогда
		Если ТекущийОбъект.ВидПолигоновПарковки.Пустая() Тогда
			Отказ = Истина;
			Сообщить("Не указан Вид полигонов парковки");
		КонецЕсли;
		Если Не ТекущийОбъект.СтавкаЗаПарковку Тогда
			Отказ = Истина;
			Сообщить("Не указана Ставка за парковку");
		КонецЕсли;
	КонецЕсли;
	СпособРасчета = ТекущийОбъект.Начисление.СпособРасчета;
	Если СпособРасчета = Перечисления.зпСпособыРасчетаНачислений.ЗаКилометрПробега Тогда
		Если ТекущийОбъект.БрейкМинимальногоПробегаПоРейсу.Пустая() Тогда
			Отказ = Истина;
			Сообщить("Не указан Брейк минимального пробега по рейсу");
		Конецесли;
	КонецЕсли;
	
КонецПроцедуры
